"""
4. Пользователь вводит целое положительное число.
Найдите самую большую цифру в числе.
Для решения используйте цикл while и арифметические операции.
"""

number = input('Please input a number :')

for i in number:
    result.append(i)

print('The maximum digit in your number is :', max(result))

