"""
3. Узнайте у пользователя число n.
Найдите сумму чисел n + nn + nnn.
Например, пользователь ввёл число 3. Считаем 3 + 33 + 333 = 369.
"""
n = int(input(' Please input an number :'))

print('The result of (n + n*n + n*n*n) is :' , (n + n*n + n*n*n))


